### Deploy Env ☁️ `dev`

#### Terraform Format and Style 🖌`✅`
#### Terraform Initialization ⚙️`✅`
#### Terraform Validation 🤖`✅`

<details><summary>Validation Output</summary>

  ```
  Success! The configuration is valid.


  ```

</details>

#### Terraform Plan 📖`✅`

<details><summary>Show Plan</summary>

  ```terraform
  Acquiring state lock. This may take a few moments...
module.s3_bucket_dev.aws_s3_bucket_public_access_block.example: Refreshing state... [id=tek-tag-generator-dev]
module.ecs.data.aws_iam_policy.ecs_managed_role_policy: Reading...
module.ecs.aws_ecs_cluster.ecs_cluster: Refreshing state... [id=arn:aws:ecs:eu-west-3:637423196893:cluster/taggenerator-cluster-dev]
module.ecs.aws_eip.elasticips["pub2"]: Refreshing state... [id=eipalloc-0e9ffd853090376d0]
module.ecs.data.aws_iam_policy_document.inline_policy_doc: Reading...
module.ecs.data.aws_iam_policy_document.assume_role: Reading...
module.ecs.aws_vpc.tag_gen_vpc: Refreshing state... [id=vpc-017424a5c2e6cdf90]
module.ecs.aws_eip.elasticips["pub1"]: Refreshing state... [id=eipalloc-0553d46b53831291f]
module.s3_bucket_dev.aws_s3_bucket.example: Refreshing state... [id=tek-tag-generator-dev]
module.ecs.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=1077804475]
module.ecs.data.aws_iam_policy_document.inline_policy_doc: Read complete after 0s [id=3977984228]
module.ecs.aws_iam_role.this: Refreshing state... [id=ECSTaskExecutionRole]
module.ecs.aws_iam_policy.inline_policy: Refreshing state... [id=arn:aws:iam::637423196893:policy/ECSTaskS3RoleInlinePolicy]
module.ecs.aws_iam_role.api_task: Refreshing state... [id=TaggeneratorApiECSTaskRole]
module.ecs.data.aws_iam_policy.ecs_managed_role_policy: Read complete after 1s [id=arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy]
module.ecs.aws_iam_role_policy_attachment.this: Refreshing state... [id=ECSTaskExecutionRole-20240821120021895800000003]
module.ecs.aws_ecs_task_definition.ui_task: Refreshing state... [id=taggenerator-ui-task-dev]
module.ecs.aws_iam_role_policy_attachment.that: Refreshing state... [id=TaggeneratorApiECSTaskRole-20240821120021803400000002]
module.ecs.aws_ecs_task_definition.api_task: Refreshing state... [id=taggenerator-api-task-dev]
module.ecs.aws_internet_gateway.ig: Refreshing state... [id=igw-036bb5ec1d62cefd8]
module.ecs.aws_service_discovery_private_dns_namespace.this: Refreshing state... [id=ns-kqie7d2lb4wjsspn]
module.ecs.aws_subnet.publics["pub1"]: Refreshing state... [id=subnet-0dc8712b262d5a518]
module.ecs.aws_subnet.publics["pub2"]: Refreshing state... [id=subnet-07e8aa05b1e51120d]
module.ecs.aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-3:637423196893:targetgroup/UI-target-group-dev/f0f3e71317a8e9ea]
module.ecs.aws_security_group.lb_security_group: Refreshing state... [id=sg-0ca470d04909e0609]
module.ecs.aws_subnet.privates["priv2"]: Refreshing state... [id=subnet-0602a2c6dd1ef7a8a]
module.ecs.aws_subnet.privates["priv1"]: Refreshing state... [id=subnet-0b1e55763308b3bf8]
module.ecs.aws_route_table.public: Refreshing state... [id=rtb-0cfc1e94edbd766dc]
module.ecs.aws_nat_gateway.nats["pub1"]: Refreshing state... [id=nat-0da37ced20d4b0201]
module.ecs.aws_nat_gateway.nats["pub2"]: Refreshing state... [id=nat-06bde84176074e196]
module.ecs.aws_route_table_association.publics["pub1"]: Refreshing state... [id=rtbassoc-026dbe8f081ef68da]
module.ecs.aws_route_table_association.publics["pub2"]: Refreshing state... [id=rtbassoc-0861618f0407bced3]
module.ecs.aws_security_group.ecs_ui_sg: Refreshing state... [id=sg-0d53496ef321285f5]
module.ecs.aws_lb.lb: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-3:637423196893:loadbalancer/app/load-balancer-dev/3b54e00f8b412c74]
module.ecs.aws_route_table.privates["priv1"]: Refreshing state... [id=rtb-066616f9855ef7057]
module.ecs.aws_route_table.privates["priv2"]: Refreshing state... [id=rtb-0701ca94047141a14]
module.s3_bucket_dev.aws_s3_bucket_ownership_controls.example: Refreshing state... [id=tek-tag-generator-dev]
module.ecs.aws_security_group.ecs_api_sg: Refreshing state... [id=sg-0cfb7463d1934be6f]
module.s3_bucket_dev.aws_s3_bucket_acl.example: Refreshing state... [id=tek-tag-generator-dev,private]
module.ecs.aws_ecs_service.ui: Refreshing state... [id=arn:aws:ecs:eu-west-3:637423196893:service/taggenerator-cluster-dev/taggenerator-ui-service-dev]
module.ecs.aws_route_table_association.privates["priv1"]: Refreshing state... [id=rtbassoc-00873a2f68a80f9b0]
module.ecs.aws_route_table_association.privates["priv2"]: Refreshing state... [id=rtbassoc-062c45c072b663f12]
module.ecs.aws_ecs_service.api: Refreshing state... [id=arn:aws:ecs:eu-west-3:637423196893:service/taggenerator-cluster-dev/taggenerator-api-service-dev]
module.ecs.aws_lb_listener.listener: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-3:637423196893:listener/app/load-balancer-dev/3b54e00f8b412c74/63b8ea19ed7887c6]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.ecs.aws_ecs_cluster.ecs_cluster has been deleted
  - resource "aws_ecs_cluster" "ecs_cluster" {
      - id       = "arn:aws:ecs:eu-west-3:637423196893:cluster/taggenerator-cluster-dev" -> null
        name     = "taggenerator-cluster-dev"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ecs.aws_lb_target_group.target_group has been deleted
  - resource "aws_lb_target_group" "target_group" {
      - arn                                = "arn:aws:elasticloadbalancing:eu-west-3:637423196893:targetgroup/UI-target-group-dev/f0f3e71317a8e9ea" -> null
        id                                 = "arn:aws:elasticloadbalancing:eu-west-3:637423196893:targetgroup/UI-target-group-dev/f0f3e71317a8e9ea"
        name                               = "UI-target-group-dev"
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs.aws_ecs_cluster.ecs_cluster will be created
  + resource "aws_ecs_cluster" "ecs_cluster" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "taggenerator-cluster-dev"
      + tags_all = {
          + "env"             = "dev"
          + "managed_by"      = "terraform"
          + "owner"           = "Tatia"
          + "region"          = "eu-west-3"
          + "resource_origin" = "https://github.com/tekeinhor/tag-generator"
        }
    }

  # module.ecs.aws_ecs_service.api will be created
  + resource "aws_ecs_service" "api" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "taggenerator-api-service-dev"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = {
          + "env"             = "dev"
          + "managed_by"      = "terraform"
          + "owner"           = "Tatia"
          + "region"          = "eu-west-3"
          + "resource_origin" = "https://github.com/tekeinhor/tag-generator"
        }
      + task_definition                    = "arn:aws:ecs:eu-west-3:637423196893:task-definition/taggenerator-api-task-dev:8"
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-0cfb7463d1934be6f",
            ]
          + subnets          = [
              + "subnet-0602a2c6dd1ef7a8a",
              + "subnet-0b1e55763308b3bf8",
            ]
        }

      + service_connect_configuration {
          + enabled   = true
          + namespace = "arn:aws:servicediscovery:eu-west-3:637423196893:namespace/ns-kqie7d2lb4wjsspn"

          + service {
              + discovery_name = "dev-api-service"
              + port_name      = "taggenerator-api-dev"

              + client_alias {
                  + dns_name = "dev-api"
                  + port     = 8080
                }
            }
        }
    }

  # module.ecs.aws_ecs_service.ui will be created
  + resource "aws_ecs_service" "ui" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "taggenerator-ui-service-dev"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = {
          + "env"             = "dev"
          + "managed_by"      = "terraform"
          + "owner"           = "Tatia"
          + "region"          = "eu-west-3"
          + "resource_origin" = "https://github.com/tekeinhor/tag-generator"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "taggenerator-ui-container"
          + container_port   = 80
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-0d53496ef321285f5",
            ]
          + subnets          = [
              + "subnet-0602a2c6dd1ef7a8a",
              + "subnet-0b1e55763308b3bf8",
            ]
        }

      + service_connect_configuration {
          + enabled   = true
          + namespace = "arn:aws:servicediscovery:eu-west-3:637423196893:namespace/ns-kqie7d2lb4wjsspn"
        }
    }

  # module.ecs.aws_ecs_task_definition.ui_task must be replaced
-/+ resource "aws_ecs_task_definition" "ui_task" {
      ~ arn                      = "arn:aws:ecs:eu-west-3:637423196893:task-definition/taggenerator-ui-task-dev:5" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-west-3:637423196893:task-definition/taggenerator-ui-task-dev" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ environment      = [
                        {
                            name  = "API_ENDPOINT_URL"
                            value = "http://dev-api:8080/api/v1/predict"
                        },
                      + {
                          + name  = "STREAMLIT_SERVER_PORT"
                          + value = "80"
                        },
                    ]
                  - essential        = true
                  - mountPoints      = []
                    name             = "taggenerator-ui-container"
                  ~ portMappings     = [
                      ~ {
                          ~ containerPort = 8501 -> 80
                          - hostPort      = 8501
                            name          = "taggenerator-ui-dev"
                            # (1 unchanged attribute hidden)
                        },
                    ]
                  - systemControls   = []
                  - volumesFrom      = []
                    # (4 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "taggenerator-ui-task-dev" -> (known after apply)
      ~ revision                 = 5 -> (known after apply)
      - tags                     = {} -> null
        # (8 unchanged attributes hidden)
    }

  # module.ecs.aws_lb_listener.listener will be created
  + resource "aws_lb_listener" "listener" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = "arn:aws:elasticloadbalancing:eu-west-3:637423196893:loadbalancer/app/load-balancer-dev/3b54e00f8b412c74"
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = {
          + "env"             = "dev"
          + "managed_by"      = "terraform"
          + "owner"           = "Tatia"
          + "region"          = "eu-west-3"
          + "resource_origin" = "https://github.com/tekeinhor/tag-generator"
        }

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.ecs.aws_lb_target_group.target_group will be created
  + resource "aws_lb_target_group" "target_group" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "UI-target-group-dev"
      + name_prefix                        = (known after apply)
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = {
          + "env"             = "dev"
          + "managed_by"      = "terraform"
          + "owner"           = "Tatia"
          + "region"          = "eu-west-3"
          + "resource_origin" = "https://github.com/tekeinhor/tag-generator"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-017424a5c2e6cdf90"
    }

  # module.ecs.aws_route_table.privates["priv1"] will be updated in-place
  ~ resource "aws_route_table" "privates" {
        id               = "rtb-066616f9855ef7057"
      ~ route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = "nat-0da37ced20d4b0201"
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "10.0.0.0/20"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = "local"
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = ""
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "nat-0da37ced20d4b0201"
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
          + {
              + cidr_block = "10.0.0.0/20"
              + gateway_id = "local"
            },
        ]
        tags             = {
            "Name" = "Private Route Table priv1"
        }
        # (5 unchanged attributes hidden)
    }

  # module.ecs.aws_route_table.privates["priv2"] will be updated in-place
  ~ resource "aws_route_table" "privates" {
        id               = "rtb-0701ca94047141a14"
      ~ route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = "nat-06bde84176074e196"
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "10.0.0.0/20"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = "local"
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = ""
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "nat-06bde84176074e196"
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
          + {
              + cidr_block = "10.0.0.0/20"
              + gateway_id = "local"
            },
        ]
        tags             = {
            "Name" = "Private Route Table priv2"
        }
        # (5 unchanged attributes hidden)
    }

  # module.ecs.aws_security_group.ecs_ui_sg will be updated in-place
  ~ resource "aws_security_group" "ecs_ui_sg" {
        id                     = "sg-0d53496ef321285f5"
      ~ ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "rule for inbound UI call"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-0ca470d04909e0609",
                ]
              + self             = false
              + to_port          = 80
            },
        ]
        name                   = "ecs-ui-dev"
        tags                   = {}
        # (7 unchanged attributes hidden)
    }

  # module.ecs.aws_security_group.lb_security_group will be updated in-place
  ~ resource "aws_security_group" "lb_security_group" {
        id                     = "sg-0ca470d04909e0609"
      ~ ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Permit incoming HTTP requests from the internet"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
        name                   = "lb-sg-dev"
        tags                   = {}
        # (7 unchanged attributes hidden)
    }

Plan: 6 to add, 4 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

  ```

</details>

*Pushed by: @tekeinhor, Action: `pull_request`*